    # -*- coding: utf-8 -*-

# Пол
GENGER_CHOICES = (
    (0, 'Мужской'),
    (1, 'Женский'),
    (2, 'Унисекс'),
)

# Механизм
MECHANISM_CHOICES = (
    (0, 'Мужской'),
    (1, 'Женский'),
)

# Корпус
BODY_CHOICES = (
    (0, 'Мужской'),
    (1, 'Женский'),
)

# Браслет
BRACELET_CHOICES = (
    (0, 'Мужской'),
    (1, 'Женский'),
)

# Длина браслета
BRACELET_LENGTH_CHOICES = (
    (0, 'Мужской'),
    (1, 'Женский'),
)

# Стекло
WINDOW_CHOICES = (
    (0, 'Мужской'),
    (1, 'Женский'),
)

# Водозащита
WATERPROOF_CHOICES = (
    (0, 'Мужской'),
    (1, 'Женский'),
)

# Гарантия
GUARANTEE_CHOICES = (
    (0, 'Мужской'),
    (1, 'Женский'),
)

# Цвет ремня/браслета
COLOR_CHOICES = (
    (0, 'Мужской'),
    (1, 'Женский'),
)

# Индикация времени
TIME_INDICATION_CHOICES = (
    (0, 'Мужской'),
    (1, 'Женский'),
)

# Покрытие корпуса
COATED_HOUSING_CHOICES = (
    (0, 'Мужской'),
    (1, 'Женский'),
)

# Форма корпуса
CASE_FORM_CHOICES = (
    (0, 'Мужской'),
    (1, 'Женский'),
)

# Покрытие браслета
COATING_BRACELET_CHOICES = (
    (0, 'Мужской'),
    (1, 'Женский'),
)

# Цвет циферблата
DIAL_COLOR_CHOICES = (
    (0, 'Мужской'),
    (1, 'Женский'),
)

# Календарь
CALENDAR_CHOICES = (
    (0, 'Мужской'),
    (1, 'Женский'),
)

# Хронограф
CHRONOGRAPH_CHOICES = (
    (0, 'Мужской'),
    (1, 'Женский'),
)

# Типа застежки
TYPE_OF_LOCK_CHOICES = (
    (0, 'Мужской'),
    (1, 'Женский'),
)
